src/cf/Catalogs/ПоказателиБизнеса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПоказателиБизнеса</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПоказателейБизнеса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеФормулы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаФормулы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыФинансовыхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолученияДанныхИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПолученияДанныхИсточника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоказателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПроцент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПоказателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьВИтогах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/СпособыПолученияДанныхИсточника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыПолученияДанныхИсточника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДтОборот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КтОборот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДтМинусКтОборот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДтСальдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КтСальдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расширение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПоказателиБизнеса/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если Параметры.Свойство("ТекущийЭлемент") Тогда
			
			ЭлементОснование = Параметры.ТекущийЭлемент;
			Объект.ВидОтчета = ЭлементОснование.ВидОтчета;
			
			Если ЭлементОснование.ТипПоказателя = Перечисления.ТипыПоказателейБизнеса.Группа Тогда
				Объект.Родитель = ЭлементОснование;
				Объект.СпособПолученияДанныхИсточника = Перечисления.СпособыПолученияДанныхИсточника.КтОборот;
				Объект.ТипПоказателя = Перечисления.ТипыПоказателейБизнеса.Расход;
			Иначе
				ЗаполнитьЗначенияСвойств(Объект, ЭлементОснование, "Родитель,ТипПоказателя,СпособПолученияДанныхИсточника");
			КонецЕсли;
			
			Объект.Порядок = ПолучитьПорядокПоРодителю(Объект.Родитель);
			
		ИначеЕсли Параметры.Свойство("ВидОтчета") Тогда
			Объект.ВидОтчета = Параметры.ВидОтчета;
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьВидимостьДоступность();
	ОбновитьПредставлениеФормулы();
	СформироватьВажноеСообщение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ссылка", Объект.Ссылка);
	СтруктураПараметров.Вставить("ВидОтчета", Объект.ВидОтчета);
	
	Оповестить("ЗаписьПоказателяФинансовыхОтчетов", СтруктураПараметров);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОписаниеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Описание", НСтр("ru = 'Описание показателя'"));
КонецПроцедуры

&НаКлиенте
Процедура ТипПоказателяПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступностьНаКлиенте();
	ОбновитьПараметрыВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность();
	 
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	Объект.Порядок = ПолучитьПорядокПоРодителю(Объект.Родитель);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособПолученияДанныхИсточникаПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступностьНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьОписание(Команда)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Описание, ЭтотОбъект, "Объект.Описание", НСтр("ru = 'Описание показателя'"));
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьФормулу(Команда)
	
	ОткрытьКонструкторФормул();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимостьДоступность()
	
	// Настройка выпадающего списка типов показателей
	ПредставлениеГруппа = НСтр("ru = 'Группа'");
	ПредставлениеФормула = НСтр("ru = 'Формула'");
	
	Если Объект.ВидОтчета = Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток Тогда
		ПредставлениеДоход  = НСтр("ru = 'Поступление'");
		ПредставлениеРасход = НСтр("ru = 'Выбытие'");
	ИначеЕсли Объект.ВидОтчета = Перечисления.ВидыФинансовыхОтчетов.Баланс Тогда
		ПредставлениеДоход  = НСтр("ru = 'Актив'");
		ПредставлениеРасход = НСтр("ru = 'Пассив'");
	Иначе
		ПредставлениеДоход  = НСтр("ru = 'Доход'");
		ПредставлениеРасход = НСтр("ru = 'Расход'");
	КонецЕсли;
	
	Элементы.ТипПоказателя.СписокВыбора.Очистить();
	Элементы.ТипПоказателя.СписокВыбора.Добавить(Перечисления.ТипыПоказателейБизнеса.Доход,   ПредставлениеДоход,,   БиблиотекаКартинок.ПоказательДоход);
	Элементы.ТипПоказателя.СписокВыбора.Добавить(Перечисления.ТипыПоказателейБизнеса.Расход,  ПредставлениеРасход,,  БиблиотекаКартинок.ПоказательРасход);
	Элементы.ТипПоказателя.СписокВыбора.Добавить(Перечисления.ТипыПоказателейБизнеса.Группа,  ПредставлениеГруппа,,  БиблиотекаКартинок.ПоказательГруппа);
	Элементы.ТипПоказателя.СписокВыбора.Добавить(Перечисления.ТипыПоказателейБизнеса.Формула, ПредставлениеФормула,, БиблиотекаКартинок.ПоказательФормула);
	
	РассчитыватьПоДанным = (Объект.ТипПоказателя = ПредопределенноеЗначение("Перечисление.ТипыПоказателейБизнеса.Доход")
							ИЛИ Объект.ТипПоказателя = ПредопределенноеЗначение("Перечисление.ТипыПоказателейБизнеса.Расход"));
						  
	РассчитыватьПоФормуле = Объект.ТипПоказателя = ПредопределенноеЗначение("Перечисление.ТипыПоказателейБизнеса.Формула");
	ЭтоПодключаемыйПоказатель = Объект.СпособПолученияДанныхИсточника = ПредопределенноеЗначение("Перечисление.СпособыПолученияДанныхИсточника.Расширение");
	
	Элементы.ГруппаРасчетПоДанным.Видимость = РассчитыватьПоДанным;
	Элементы.ГруппаРасчетПоФормуле.Видимость = РассчитыватьПоФормуле;
	Элементы.ГруппаПодсказкаДляПользователя.Видимость = ЭтоПодключаемыйПоказатель;
	Элементы.ИсточникДанных.Видимость = НЕ ЭтоПодключаемыйПоказатель;
	Элементы.Коэффициент.Видимость = НЕ ЭтоПодключаемыйПоказатель;
	
	ОбновитьПараметрыВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДоступностьНаКлиенте()
	
	РассчитыватьПоДанным = (Объект.ТипПоказателя = ПредопределенноеЗначение("Перечисление.ТипыПоказателейБизнеса.Доход")
							ИЛИ Объект.ТипПоказателя = ПредопределенноеЗначение("Перечисление.ТипыПоказателейБизнеса.Расход"));
						  
	РассчитыватьПоФормуле = Объект.ТипПоказателя = ПредопределенноеЗначение("Перечисление.ТипыПоказателейБизнеса.Формула");
	
	ЭтоПодключаемыйПоказатель = Объект.СпособПолученияДанныхИсточника = ПредопределенноеЗначение("Перечисление.СпособыПолученияДанныхИсточника.Расширение");
	
	Элементы.ГруппаРасчетПоДанным.Видимость = РассчитыватьПоДанным;
	Элементы.ГруппаРасчетПоФормуле.Видимость = РассчитыватьПоФормуле;
	Элементы.ГруппаПодсказкаДляПользователя.Видимость = ЭтоПодключаемыйПоказатель;
	Элементы.ИсточникДанных.Видимость = НЕ ЭтоПодключаемыйПоказатель;
	Элементы.Коэффициент.Видимость = НЕ ЭтоПодключаемыйПоказатель;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыВыбора()
	
	Если Объект.ВидОтчета = Перечисления.ВидыФинансовыхОтчетов.ДоходыРасходы Тогда
		
		Элементы.ИсточникДанных.ВыбиратьТип = Ложь;
		
		Если НЕ ЗначениеЗаполнено(Объект.ИсточникДанных) Тогда
			Объект.ИсточникДанных = ПланыСчетов.Управленческий.ПустаяСсылка();
		КонецЕсли;
		
		МассивПараметров = Новый Массив;
		
		Если Объект.ТипПоказателя = Перечисления.ТипыПоказателейБизнеса.Доход Тогда
			
			ТипыСчетов = Новый Массив;
			ТипыСчетов.Добавить(Перечисления.ТипыСчетов.Доходы);
			ТипыСчетов.Добавить(Перечисления.ТипыСчетов.ПрочиеДоходы);
			ТипыСчетов.Добавить(Перечисления.ТипыСчетов.НалогНаПрибыль);
			
			НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСчета", Новый ФиксированныйМассив(ТипыСчетов));
			МассивПараметров.Добавить(НовыйПараметр);
			
		ИначеЕсли Объект.ТипПоказателя = Перечисления.ТипыПоказателейБизнеса.Расход Тогда
			
			ТипыСчетов = Новый Массив;
			ТипыСчетов.Добавить(Перечисления.ТипыСчетов.Расходы);
			ТипыСчетов.Добавить(Перечисления.ТипыСчетов.ПрочиеРасходы);
			ТипыСчетов.Добавить(Перечисления.ТипыСчетов.СебестоимостьПродаж);
			ТипыСчетов.Добавить(Перечисления.ТипыСчетов.ПроцентыПоКредитам);
			ТипыСчетов.Добавить(Перечисления.ТипыСчетов.НезавершенноеПроизводство);
			ТипыСчетов.Добавить(Перечисления.ТипыСчетов.КосвенныеЗатраты);
			
			НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСчета", Новый ФиксированныйМассив(ТипыСчетов));
			МассивПараметров.Добавить(НовыйПараметр);
			
		КонецЕсли;
		
		Элементы.ИсточникДанных.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров); 
		
	ИначеЕсли Объект.ВидОтчета = Перечисления.ВидыФинансовыхОтчетов.ДенежныйПоток Тогда
		
		Элементы.ИсточникДанных.ВыбиратьТип = Ложь;
		
		Если НЕ ЗначениеЗаполнено(Объект.ИсточникДанных) Тогда
			Объект.ИсточникДанных = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
		КонецЕсли;
		
		МассивПараметров = Новый Массив;
		Элементы.ИсточникДанных.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		
	Иначе // Баланс
		
		Элементы.ИсточникДанных.ВыбиратьТип = Ложь;
		
		Если НЕ ЗначениеЗаполнено(Объект.ИсточникДанных) Тогда
			Объект.ИсточникДанных = ПланыСчетов.Управленческий.ПустаяСсылка();
		КонецЕсли;
		
		МассивПараметров = Новый Массив;
		Элементы.ИсточникДанных.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеФормулы()
	
	Если НЕ Объект.ТипПоказателя = Перечисления.ТипыПоказателейБизнеса.Формула Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрок = Новый Массив;
	МассивОперандов = Новый Массив;
	ТекстФормулы = Объект.СтрокаФормулы;
	
	ПоказателиБизнесаФормулы.ПарсингФормулыНаИдентификаторыОперандов(ТекстФормулы, МассивОперандов);
	
	Для каждого Операнд Из МассивОперандов Цикл
		
		СтрокаДоОперанда = Лев(ТекстФормулы, СтрНайти(ТекстФормулы, Операнд)-2);
		МассивСтрок.Добавить(СтрокаДоОперанда);
		Показатель = ПоказателиБизнесаФормулы.НайтиПоказательПоИдентификатору(Операнд);
		ТекстФормулы = СтрЗаменить(ТекстФормулы, Операнд, Строка(Показатель.Показатель));
		
	КонецЦикла;
	
	ПредставлениеФормулы = ТекстФормулы;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПорядокПоРодителю(Родитель)
	
	Порядок = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказателиБизнеса.Родитель КАК Родитель,
		|	МАКСИМУМ(ПоказателиБизнеса.Порядок) КАК Порядок
		|ИЗ
		|	Справочник.ПоказателиБизнеса КАК ПоказателиБизнеса
		|ГДЕ
		|	ПоказателиБизнеса.Родитель = &Родитель
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоказателиБизнеса.Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	ВыборкаРодитель = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаРодитель.Следующий() Тогда
		Порядок = ВыборкаРодитель.Порядок;
	КонецЕсли;
	
	Порядок = Порядок + 1;
	
	Возврат Порядок;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьКонструкторФормул()
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидОтчета", Объект.ВидОтчета);
	ПараметрыОткрытия.Вставить("ТекущийПоказатель", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("СтрокаФормулы", Объект.СтрокаФормулы);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияКонструктораФормул", ЭтотОбъект);
	ОткрытьФорму("Справочник.ПоказателиБизнеса.Форма.КонструкторФормул", ПараметрыОткрытия, ЭтотОбъект,,,,
		ОповещениеОЗакрытии, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияКонструктораФормул(ПараметрыЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПараметрыЗакрытия) ИЛИ ПараметрыЗакрытия.Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	Объект.СтрокаФормулы = ПараметрыЗакрытия.СтрокаФормулы;
	ОбновитьПредставлениеФормулы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИдентификаторПоказателяНаСервере()
	
	СсылкаНовогоЭлемента = Справочники.ПоказателиБизнеса.ПолучитьСсылку();
	Объект.ИдентификаторПоказателя = СсылкаНовогоЭлемента.УникальныйИдентификатор();
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	СправочникОбъект.УстановитьСсылкуНового(СсылкаНовогоЭлемента);
	ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьВажноеСообщение()
	
	ИдентификаторСообщения = "ИнструкцияДляРасширения";
	
	ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыСообщения.Идентификатор = ИдентификаторСообщения;
	ПараметрыСообщения.Скрываемый = Ложь;
	ПараметрыСообщения.Родитель = Элементы.ГруппаПодсказкаДляПользователя.Имя;
	ПараметрыСообщения.ТипСообщения = "Информация";
	ПараметрыСообщения.ПараметрыДействия = Новый Массив;
	ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Инструкция'");
	ТекстСообщения = НСтр("ru = 'Данная возможность позволяет создать показатель из любых данных вашей базы. 
						|Для этого необходимо создать расширение по шаблону. 
						|Если у вас нет опыта работы в конфигураторе, сформулируйте запрос и обратитесь в свою обслуживающую организацию.'");
						
	ПараметрыСообщения.Сообщение = ТекстСообщения;
	
	ПараметрыДействияСообщения = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	ПараметрыДействияСообщения.ИмяКоманды = "ПерейтиКИнструкции";
	ПараметрыДействияСообщения.Обработчик = "Подключаемый_ПерейтиКИнструкции";
	ПараметрыДействияСообщения.Заголовок = НСтр("ru = 'Инструкция для технического специалиста'");
	
	ПараметрыСообщения.ПараметрыДействия.Добавить(ПараметрыДействияСообщения);
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКИнструкции(Команда)
	
	Если Объект.СпособПолученияДанныхИсточника = ПредопределенноеЗначение("Перечисление.СпособыПолученияДанныхИсточника.Расширение") Тогда
		Если Объект.Ссылка.Пустая() Тогда
			ЗаполнитьИдентификаторПоказателяНаСервере()
		КонецЕсли;
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ИдентификаторПоказателя", Объект.ИдентификаторПоказателя);
		ОткрытьФорму("ОбщаяФорма.ПомощникПодключенияПроцедурыРасширения", ПараметрыОткрытия,,,,,,РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
